package lkovsher.Lab2;

public class TaskA2 {
    public static void main(String[] args) {
        String s1,s2,s3,s4,s5,s6,s7,s8;
        s1= "Сжала руки под тёмной вуалью…";
        s2="«Отчего ты сегодня бледна?»";
        s3="— Оттого, что я терпкой печалью";
        s4="Напоила его допьяна.";
        s5="Как забуду? Он вышел, шатаясь,";
        s6="Искривился мучительно рот…";
        s7="Я сбежала, перил не касаясь,";
        s8="Я бежала за ним до ворот.";
        System.out.println("Мое любимое стихотворение:" + "\n" + s1+ "\n" + s2 + "\n"+ s3+ "\n" +s4+"\n" + s5 + "\n" + s6 + "\n" + s7 + "\n" + s8);
    }
}
