package ryancharuk.homework;

public class poem {
	public static void main(String[] args) {
		String a = "Моё любимое стрихоторение:\n\n";
		String b = "В стране Ксанад благословенной\n";
		String c = "Дворец построил Кубла Хан,\n";
		String d = "Где Альф бежит, поток священный,\n";
		String j = "Сквозь мглу пещер гигантских, пенный.\n" +
				"Впадает в сонный океан.\n" +
				" \n" +
				"На десять миль оградой стен и башен\n" +
				"Оазис плодородный окружён,\n" +
				"Садами и ручьями он украшен,\n" +
				"В нём фимиам цветы струят сквозь сон,\n" +
				"И древний лес, роскошен и печален,\n" +
				"Блистает там воздушностью прогалин.";
		System.out.println(a + b + c + d + j);
	}
}
