package ryancharuk.homework;

public class poem {
	public static void main(String[] args) {
		String a = "Моё любимое стрихоторение:\n\n";
		String b = "В стране Ксанад благословенной\n";
		String c = "Дворец построил Кубла Хан,\n";
		String d = "Где Альф бежит, поток священный,\n";
		String j = "Сквозь мглу пещер гигантских, пенный.\n" +
				"\t\t\t\tВпадает в сонный океан.\n" +
				"\t\t\t\t    \n" +
				"\t\t\t\tНа десять миль оградой стен и башен\n" +
				"\t\t\t\tОазис плодородный окружён,\n" +
				"\t\t\t\tСадами и ручьями он украшен,\n" +
				"\t\t\t\tВ нём фимиам цветы струят сквозь сон,\n" +
				"\t\t\t\tИ древний лес, роскошен и печален,\n" +
				"\t\t\t\tБлистает там воздушностью прогалин.";
		System.out.println(a + b +c + d +j);
	}
}
