package ryancharuk.homework;

public class poem {
	public static void main(String[] args) {
		String a = "Моё любимое стрихоторение:\n\n";
		String b = "В стране Ксанад благословенной\n";
		String c = "Дворец построил Кубла Хан,\n";
		String d = "Где Альф бежит, поток священный,\n";
		String j = """
				Сквозь мглу пещер гигантских, пенный.
				Впадает в сонный океан.
				    
				На десять миль оградой стен и башен
				Оазис плодородный окружён,
				Садами и ручьями он украшен,
				В нём фимиам цветы струят сквозь сон,
				И древний лес, роскошен и печален,
				Блистает там воздушностью прогалин.""";
		System.out.println(a + b +c + d +j);
	}
}
